/*
 * map.cpp
 *
 *  Created on: 20 дек. 2023 г.
 *      Author: user
 */




#include "map.h"
line_type lines[] = {

		{{2,145},{230, 145}},//нижний пол


		{{230,145},{280, 150}},//нижний пол
		{{280, 150},{360, 173}},//нижний пол


		//{{144,145},{280, 285}},//наклон для испытания тормозов
		//{{280,145},{651, 12}},//наклон для испытания тормозов

					{{2,200},{2, 50}},//первая стена




					{{2,50},{52, 50}},//нижний пол


					{{52,50},{52, 52}},//заборчик
					{{52,52},{75, 40}},//наклон

					{{75,40},{75, 56}},//короткая стенка

					{{75,56},{95, 56}},//пол

					{{95, 56},{95+50, 20}},//стена


					{{95+50, 20},{195, 20}},//пол

					{{195, 20},{395, 40}},//наклон


					{{395, 40},{695, 40}},//пол



		    	};
int get_whalls_count(){

	return sizeof(lines)/sizeof(lines[0]);

}
void draw_whalls(void)
{
	glColor3d(0,0,0);
	int size_ar = get_whalls_count();
	for (int i=0; i < size_ar; i++){
    glBegin(GL_LINES);
    	glVertex2f(lines[i].a.x, lines[i].a.y);
    	glVertex2f(lines[i].b.x, lines[i].b.y);
    glEnd();
	}
}
